espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/mcpwm_eco5_struct.h
/** Type of genn_tstmp_b register
 *  Generatorn time stamp B's shadow register
 */
typedef union {
    struct {
        /** cmprn_b : R/W; bitpos: [15:0]; default: 0;
         *  Configures the value of PWM generator n time stamp B's shadow register.
         */
        uint32_t cmprn_b:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_genn_tstmp_b_reg_t;

/** Type of genn_cfg0 register
 *  Generatorn fault event T0 and T1 configuration register
 */
typedef union {
    struct {
        /** genn_cfg_upmethod : R/W; bitpos: [3:0]; default: 0;
         *  Configures update method for PWM generator n's active register.
         *  0: Immediately
         *  Bit0 is set to 1: TEZ
         *  Bit1 is set to 1: TEP
         *  Bit2 is set to 1: Sync
         *  Bit3 is set to 1: Disable the update
         */
        uint32_t genn_cfg_upmethod:4;
        /** genn_t0_sel : R/W; bitpos: [6:4]; default: 0;
         *  Configures source selection for PWM generator n event_t0, take effect immediately.
         *  0: fault_event0
         *  1: fault_event1
         *  2: fault_event2
         *  3: sync_taken
         *  4: Invalid, Select nothing
         */
        uint32_t genn_t0_sel:3;
        /** genn_t1_sel : R/W; bitpos: [9:7]; default: 0;
         *  Configures source selection for PWM generator n event_t1, take effect immediately.
         *  0: fault_event0
         *  1: fault_event1
         *  2: fault_event2
         *  3: sync_taken
         *  4: Invalid, Select nothing
         */
        uint32_t genn_t1_sel:3;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} mcpwm_genn_cfg0_reg_t;

/** Type of genn_force register
 *  Generatorn output signal force mode register.
 */
typedef union {
    struct {
        /** genn_cntuforce_upmethod : R/W; bitpos: [5:0]; default: 32;
         *  Configures update method for continuous software force of PWM generatorn.
         *  0: Immediately
         *  Bit0 is set to 1: TEZ
         *  Bit1 is set to 1: TEP
         *  Bit2 is set to 1: TEA
         *  Bit3 is set to 1: TEB
         *  Bit4 is set to 1: Sync
         *  Bit5 is set to 1: Disable update. TEA/B here and below means an event generated
         *  when the timer's value equals to that of register A/B.
         */
        uint32_t genn_cntuforce_upmethod:6;
        /** genn_a_cntuforce_mode : R/W; bitpos: [7:6]; default: 0;
         *  Configures continuous software force mode for PWMn A.
         *  0: Disabled
         *  1: Low
         *  2: High
         *  3: Disabled
         */
        uint32_t genn_a_cntuforce_mode:2;
        /** genn_b_cntuforce_mode : R/W; bitpos: [9:8]; default: 0;
         *  Configures continuous software force mode for PWMn B.
         *  0: Disabled
         *  1: Low
         *  2: High
         *  3: Disabled
         */
        uint32_t genn_b_cntuforce_mode:2;
        /** genn_a_nciforce : R/W; bitpos: [10]; default: 0;
         *  Configures the generation of non-continuous immediate software-force event for PWMn
         *  A, a toggle will trigger a force event.
         */
        uint32_t genn_a_nciforce:1;
        /** genn_a_nciforce_mode : R/W; bitpos: [12:11]; default: 0;
         *  Configures non-continuous immediate software force mode for PWMn A.
         *  0: Disabled
         *  1: Low
         *  2: High
         *  3: Disabled
         */
        uint32_t genn_a_nciforce_mode:2;
        /** genn_b_nciforce : R/W; bitpos: [13]; default: 0;
         *  Configures the generation of non-continuous immediate software-force event for PWMn
         *  B, a toggle will trigger a force event.
         */
        uint32_t genn_b_nciforce:1;
        /** genn_b_nciforce_mode : R/W; bitpos: [15:14]; default: 0;
         *  Configures non-continuous immediate software force mode for PWMn B.
         *  0: Disabled
         *  1: Low
         *  2: High
         *  3: Disabled
         */
        uint32_t genn_b_nciforce_mode:2;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_genn_force_reg_t;

/** Type of genn_a register
 *  PWMn output signal A actions configuration register
 */
typedef union {
    struct {
        /** genn_a_utez : R/W; bitpos: [1:0]; default: 0;
         *  Configures action on PWMn A triggered by event TEZ when timer increasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_a_utez:2;
        /** genn_a_utep : R/W; bitpos: [3:2]; default: 0;
         *  Configures action on PWMn A triggered by event TEP when timer increasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_a_utep:2;
        /** genn_a_utea : R/W; bitpos: [5:4]; default: 0;
         *  Configures action on PWMn A triggered by event TEA when timer increasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_a_utea:2;
        /** genn_a_uteb : R/W; bitpos: [7:6]; default: 0;
         *  Configures action on PWMn A triggered by event TEB when timer increasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_a_uteb:2;
        /** genn_a_ut0 : R/W; bitpos: [9:8]; default: 0;
         *  Configures action on PWMn A triggered by event_t0 when timer increasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_a_ut0:2;
        /** genn_a_ut1 : R/W; bitpos: [11:10]; default: 0;
         *  Configures action on PWMn A triggered by event_t1 when timer increasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_a_ut1:2;
        /** genn_a_dtez : R/W; bitpos: [13:12]; default: 0;
         *  Configures action on PWMn A triggered by event TEZ when timer decreasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_a_dtez:2;
        /** genn_a_dtep : R/W; bitpos: [15:14]; default: 0;
         *  Configures action on PWMn A triggered by event TEP when timer decreasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_a_dtep:2;
        /** genn_a_dtea : R/W; bitpos: [17:16]; default: 0;
         *  Configures action on PWMn A triggered by event TEA when timer decreasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_a_dtea:2;
        /** genn_a_dteb : R/W; bitpos: [19:18]; default: 0;
         *  Configures action on PWMn A triggered by event TEB when timer decreasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_a_dteb:2;
        /** genn_a_dt0 : R/W; bitpos: [21:20]; default: 0;
         *  Configures action on PWMn A triggered by event_t0 when timer decreasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_a_dt0:2;
        /** genn_a_dt1 : R/W; bitpos: [23:22]; default: 0;
         *  Configures action on PWMn A triggered by event_t1 when timer decreasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_a_dt1:2;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} mcpwm_genn_a_reg_t;

/** Type of genn_b register
 *  PWMn output signal B actions configuration register
 */
typedef union {
    struct {
        /** genn_b_utez : R/W; bitpos: [1:0]; default: 0;
         *  Configures action on PWMn B triggered by event TEZ when timer increasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_b_utez:2;
        /** genn_b_utep : R/W; bitpos: [3:2]; default: 0;
         *  Configures action on PWMn B triggered by event TEP when timer increasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_b_utep:2;
        /** genn_b_utea : R/W; bitpos: [5:4]; default: 0;
         *  Configures action on PWMn B triggered by event TEA when timer increasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_b_utea:2;
        /** genn_b_uteb : R/W; bitpos: [7:6]; default: 0;
         *  Configures action on PWMn B triggered by event TEB when timer increasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_b_uteb:2;
        /** genn_b_ut0 : R/W; bitpos: [9:8]; default: 0;
         *  Configures action on PWMn B triggered by event_t0 when timer increasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_b_ut0:2;
        /** genn_b_ut1 : R/W; bitpos: [11:10]; default: 0;
         *  Configures action on PWMn B triggered by event_t1 when timer increasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_b_ut1:2;
        /** genn_b_dtez : R/W; bitpos: [13:12]; default: 0;
         *  Configures action on PWMn B triggered by event TEZ when timer decreasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_b_dtez:2;
        /** genn_b_dtep : R/W; bitpos: [15:14]; default: 0;
         *  Configures action on PWMn B triggered by event TEP when timer decreasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_b_dtep:2;
        /** genn_b_dtea : R/W; bitpos: [17:16]; default: 0;
         *  Configures action on PWMn B triggered by event TEA when timer decreasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_b_dtea:2;
        /** genn_b_dteb : R/W; bitpos: [19:18]; default: 0;
         *  Configures action on PWMn B triggered by event TEB when timer decreasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_b_dteb:2;
        /** genn_b_dt0 : R/W; bitpos: [21:20]; default: 0;
         *  Configures action on PWMn B triggered by event_t0 when timer decreasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_b_dt0:2;
        /** genn_b_dt1 : R/W; bitpos: [23:22]; default: 0;
         *  Configures action on PWMn B triggered by event_t1 when timer decreasing.
         *  0: No change
         *  1: Low
         *  2: High
         *  3: Toggle
         */
        uint32_t genn_b_dt1:2;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} mcpwm_genn_b_reg_t;

/** Type of dtn_cfg register
 *  Dead time configuration register
 */
typedef union {
    struct {
        /** dbn_fed_upmethod : R/W; bitpos: [3:0]; default: 0;
         *  Configures update method for FED (Falling edge delay) active register.
         *  0: Immediate
         *  Bit0 is set to 1: TEZ
         *  Bit1 is set to 1: TEP
         *  Bit2 is set to 1: Sync
         *  Bit3 is set to 1: Disable the update
         */
        uint32_t dbn_fed_upmethod:4;
        /** dbn_red_upmethod : R/W; bitpos: [7:4]; default: 0;
         *  Configures update method for RED (rising edge delay) active register.
         *  0: Immediate
         *  Bit0 is set to 1: TEZ
         *  Bit1 is set to 1: TEP
         *  Bit2 is set to 1: Sync
         *  Bit3 is set to 1: Disable the update
         */
        uint32_t dbn_red_upmethod:4;
        /** dbn_deb_mode : R/W; bitpos: [8]; default: 0;
         *  Configures S8 in table, dual-edge B mode.
         *  0: fed/red take effect on different path separately
         *  1: fed/red take effect on B path, A out is in bypass or dulpB mode
         */
        uint32_t dbn_deb_mode:1;
        /** dbn_a_outswap : R/W; bitpos: [9]; default: 0;
         *  Configures S6 in table.
         */
        uint32_t dbn_a_outswap:1;
        /** dbn_b_outswap : R/W; bitpos: [10]; default: 0;
         *  Configures S7 in table.
         */
        uint32_t dbn_b_outswap:1;
        /** dbn_red_insel : R/W; bitpos: [11]; default: 0;
         *  Configures S4 in table.
         */
        uint32_t dbn_red_insel:1;
        /** dbn_fed_insel : R/W; bitpos: [12]; default: 0;
         *  Configures S5 in table.
         */
        uint32_t dbn_fed_insel:1;
        /** dbn_red_outinvert : R/W; bitpos: [13]; default: 0;
         *  Configures S2 in table.
         */
        uint32_t dbn_red_outinvert:1;
        /** dbn_fed_outinvert : R/W; bitpos: [14]; default: 0;
         *  Configures S3 in table.
         */
        uint32_t dbn_fed_outinvert:1;
        /** dbn_a_outbypass : R/W; bitpos: [15]; default: 1;
         *  Configures S1 in table.
         */
        uint32_t dbn_a_outbypass:1;
        /** dbn_b_outbypass : R/W; bitpos: [16]; default: 1;
         *  Configures S0 in table.
         */
        uint32_t dbn_b_outbypass:1;
        /** dbn_clk_sel : R/W; bitpos: [17]; default: 0;
         *  Configures dead time generator n clock selection.
         *  0: PWM_clk
         *  1: PT_clk
         */
        uint32_t dbn_clk_sel:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} mcpwm_dtn_cfg_reg_t;

/** Type of dtn_fed_cfg register
 *  Falling edge delay (FED) shadow register
 */
typedef union {
    struct {
        /** dbn_fed : R/W; bitpos: [15:0]; default: 0;
         *  Configures shadow register for FED.
         */
        uint32_t dbn_fed:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_dtn_fed_cfg_reg_t;

/** Type of dtn_red_cfg register
 *  Rising edge delay (RED) shadow register
 */
typedef union {
    struct {
        /** dbn_red : R/W; bitpos: [15:0]; default: 0;
         *  Configures shadow register for RED.
         */
        uint32_t dbn_red:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_dtn_red_cfg_reg_t;

/** Type of carriern_cfg register
 *  Carriern configuration register
 */
typedef union {
    struct {
        /** choppern_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable carriern.
         *  0: Bypassed
         *  1: Enabled
         */
        uint32_t choppern_en:1;
        /** choppern_prescale : R/W; bitpos: [4:1]; default: 0;
         *  Configures the prescale value of PWM carriern clock (PC_clk), so that period of
         *  PC_clk = period of PWM_clk * (PWM_CARRIERn_PRESCALE + 1)
         */
        uint32_t choppern_prescale:4;
        /** choppern_duty : R/W; bitpos: [7:5]; default: 0;
         *  Configures carrier duty. Duty = PWM_CARRIERn_DUTY / 8
         */
        uint32_t choppern_duty:3;
        /** choppern_oshtwth : R/W; bitpos: [11:8]; default: 0;
         *  Configures width of the first pulse. Measurement unit: Periods of the carrier.
         */
        uint32_t choppern_oshtwth:4;
        /** choppern_out_invert : R/W; bitpos: [12]; default: 0;
         *  Configures whether or not to invert the output of PWMn A and PWMn B for this
         *  submodule.
         *  0: Normal
         *  1: Invert
         */
        uint32_t choppern_out_invert:1;
        /** choppern_in_invert : R/W; bitpos: [13]; default: 0;
         *  Configures whether or not to invert the input of PWMn A and PWMn B for this
         *  submodule.
         *  0: Normal
         *  1: Invert
         */
        uint32_t choppern_in_invert:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} mcpwm_carriern_cfg_reg_t;

/** Type of fhn_cfg0 register
 *  PWMn A and PWMn B trip events actions configuration register
 */
typedef union {
    struct {
        /** tzn_sw_cbc : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable software force cycle-by-cycle mode action.
         *  0: Disable
         *  1: Enable
         */
        uint32_t tzn_sw_cbc:1;
        /** tzn_f2_cbc : R/W; bitpos: [1]; default: 0;
         *  Configures whether or not event_f2 will trigger cycle-by-cycle mode action.
         *  0: Disable
         *  1: Enable
         */
        uint32_t tzn_f2_cbc:1;
        /** tzn_f1_cbc : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not event_f1 will trigger cycle-by-cycle mode action.
         *  0: Disable
         *  1: Enable
         */
        uint32_t tzn_f1_cbc:1;
        /** tzn_f0_cbc : R/W; bitpos: [3]; default: 0;
         *  Configures whether or not event_f0 will trigger cycle-by-cycle mode action.
         *  0: Disable
         *  1: Enable
         */
        uint32_t tzn_f0_cbc:1;
        /** tzn_sw_ost : R/W; bitpos: [4]; default: 0;
         *  Configures whether or not to enable software force one-shot mode action.
         *  0: Disable
         *  1: Enable
         */
        uint32_t tzn_sw_ost:1;
        /** tzn_f2_ost : R/W; bitpos: [5]; default: 0;
         *  Configures whether or not event_f2 will trigger one-shot mode action.
         *  0: Disable
         *  1: Enable
         */
        uint32_t tzn_f2_ost:1;
        /** tzn_f1_ost : R/W; bitpos: [6]; default: 0;
         *  Configures whether or not event_f1 will trigger one-shot mode action.
         *  0: Disable
         *  1: Enable
         */
        uint32_t tzn_f1_ost:1;
        /** tzn_f0_ost : R/W; bitpos: [7]; default: 0;
         *  Configures whether or not event_f0 will trigger one-shot mode action.
         *  0: Disable
         *  1: Enable
         */
        uint32_t tzn_f0_ost:1;
        /** tzn_a_cbc_d : R/W; bitpos: [9:8]; default: 0;
         *  Configures cycle-by-cycle mode action on PWMn A when fault event occurs and timer
         *  is decreasing.
         *  0: Do nothing
         *  1: Force low
         *  2: Force high
         *  3: Toggle
         */
        uint32_t tzn_a_cbc_d:2;
        /** tzn_a_cbc_u : R/W; bitpos: [11:10]; default: 0;
         *  Configures cycle-by-cycle mode action on PWMn A when fault event occurs and timer
         *  is increasing.
         *  0: Do nothing
         *  1: Force low
         *  2: Force high
         *  3: Toggle
         */
        uint32_t tzn_a_cbc_u:2;
        /** tzn_a_ost_d : R/W; bitpos: [13:12]; default: 0;
         *  Configures one-shot mode action on PWMn A when fault event occurs and timer is
         *  decreasing.
         *  0: Do nothing
         *  1: Force low
         *  2: Force high
         *  3: Toggle
         */
        uint32_t tzn_a_ost_d:2;
        /** tzn_a_ost_u : R/W; bitpos: [15:14]; default: 0;
         *  Configures one-shot mode action on PWMn A when fault event occurs and timer is
         *  increasing.
         *  0: Do nothing
         *  1: Force low
         *  2: Force high
         *  3: Toggle
         */
        uint32_t tzn_a_ost_u:2;
        /** tzn_b_cbc_d : R/W; bitpos: [17:16]; default: 0;
         *  Configures cycle-by-cycle mode action on PWMn B when fault event occurs and timer
         *  is decreasing.
         *  0: Do nothing
         *  1: Force low
         *  2: Force high
         *  3: Toggle
         */
        uint32_t tzn_b_cbc_d:2;
        /** tzn_b_cbc_u : R/W; bitpos: [19:18]; default: 0;
         *  Configures cycle-by-cycle mode action on PWMn B when fault event occurs and timer
         *  is increasing.
         *  0: Do nothing
         *  1: Force low
         *  2: Force high
         *  3: Toggle
         */
        uint32_t tzn_b_cbc_u:2;
        /** tzn_b_ost_d : R/W; bitpos: [21:20]; default: 0;
         *  Configures one-shot mode action on PWMn B when fault event occurs and timer is
         *  decreasing.
         *  0: Do nothing
         *  1: Force low
         *  2: Force high
         *  3: Toggle
         */
        uint32_t tzn_b_ost_d:2;
        /** tzn_b_ost_u : R/W; bitpos: [23:22]; default: 0;
         *  Configures one-shot mode action on PWMn B when fault event occurs and timer is
         *  increasing.
         *  0: Do nothing
         *  1: Force low
         *  2: Force high
         *  3: Toggle
         */
        uint32_t tzn_b_ost_u:2;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} mcpwm_fhn_cfg0_reg_t;

/** Type of fhn_cfg1 register
 *  Software triggers for fault handler actions configuration register
 */
typedef union {
    struct {
        /** tzn_clr_ost : R/W; bitpos: [0]; default: 0;
         *  Configures the generation of software one-shot mode action clear. A toggle
         *  (software negate its value) triggers a clear for on going one-shot mode action.
         */
        uint32_t tzn_clr_ost:1;
        /** tzn_cbcpulse : R/W; bitpos: [2:1]; default: 0;
         *  Configures the refresh moment selection of cycle-by-cycle mode action.
         *  0: Select nothing, will not refresh
         *  Bit0 is set to 1: TEZ
         *  Bit1 is set to 1: TEP
         */
        uint32_t tzn_cbcpulse:2;
        /** tzn_force_cbc : R/W; bitpos: [3]; default: 0;
         *  Configures the generation of software cycle-by-cycle mode action. A toggle
         *  (software negate its value) triggers a cycle-by-cycle mode action.
         */
        uint32_t tzn_force_cbc:1;
        /** tzn_force_ost : R/W; bitpos: [4]; default: 0;
         *  Configures the generation of software one-shot mode action. A toggle (software
         *  negate its value) triggers a one-shot mode action.
         */
        uint32_t tzn_force_ost:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} mcpwm_fhn_cfg1_reg_t;

/** Type of fault_detect register
 *  Fault detection configuration and status register
 */
typedef union {
    struct {
        /** f0_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable event_f0 generation.
         *  0: Disable
         *  1: Enable
         */
        uint32_t f0_en:1;
        /** f1_en : R/W; bitpos: [1]; default: 0;
         *  Configures whether or not to enable event_f1 generation.
         *  0: Disable
         *  1: Enable
         */
        uint32_t f1_en:1;
        /** f2_en : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not to enable event_f2 generation.
         *  0: Disable
         *  1: Enable
         */
        uint32_t f2_en:1;
        /** f0_pole : R/W; bitpos: [3]; default: 0;
         *  Configures event_f0 trigger polarity on FAULT0 source from GPIO matrix.
         *  0: Level low
         *  1: Level high
         */
        uint32_t f0_pole:1;
        /** f1_pole : R/W; bitpos: [4]; default: 0;
         *  Configures event_f1 trigger polarity on FAULT1 source from GPIO matrix.
         *  0: Level low
         *  1: Level high
         */
        uint32_t f1_pole:1;
        /** f2_pole : R/W; bitpos: [5]; default: 0;
         *  Configures event_f2 trigger polarity on FAULT2 source from GPIO matrix.
         *  0: Level low
         *  1: Level high
         */
        uint32_t f2_pole:1;
        /** event_f0 : RO; bitpos: [6]; default: 0;
         *  Represents whether or not an event_f0 is on going.
         *  0: No action
         *  1: On going
         */
        uint32_t event_f0:1;
        /** event_f1 : RO; bitpos: [7]; default: 0;
         *  Represents whether or not an event_f1 is on going.
         *  0: No action
         *  1: On going
         */
        uint32_t event_f1:1;
        /** event_f2 : RO; bitpos: [8]; default: 0;
         *  Represents whether or not an event_f2 is on going.
         *  0: No action
         *  1: On going
         */
        uint32_t event_f2:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} mcpwm_fault_detect_reg_t;

