espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/mcpwm_eco5_struct.h
/** Type of opn_tstmp_e1 register
 *  Generatorn timer stamp E1 value register
 */
typedef union {
    struct {
        /** opn_tstmp_e1 : R/W; bitpos: [15:0]; default: 0;
         *  Configures generatorn timer stamp E1 value register
         */
        uint32_t opn_tstmp_e1:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_opn_tstmp_e1_reg_t;

/** Type of opn_tstmp_e2 register
 *  Generatorn timer stamp E2 value register
 */
typedef union {
    struct {
        /** opn_tstmp_e2 : R/W; bitpos: [15:0]; default: 0;
         *  Configures generatorn timer stamp E2 value register
         */
        uint32_t opn_tstmp_e2:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_opn_tstmp_e2_reg_t;

/** Type of clk register
 *  Global configuration register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to open register clock gate.
         *  0: Open the clock gate only when application writes registers
         *  1: Force open the clock gate for register
         */
        uint32_t clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} mcpwm_clk_reg_t;


/** Group: Status register */
/** Type of timern_status register
 *  PWM timern status register.
 */
typedef union {
    struct {
        /** timern_value : RO; bitpos: [15:0]; default: 0;
         *  Represents current PWM timern counter value.
         */
        uint32_t timern_value:16;
        /** timern_direction : RO; bitpos: [16]; default: 0;
         *  Represents current PWM timern counter direction.
         *  0: Increment
         *  1: Decrement
         */
        uint32_t timern_direction:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} mcpwm_timern_status_reg_t;

/** Type of fhn_status register
 *  Fault events status register
 */
typedef union {
    struct {
        /** tzn_cbc_on : RO; bitpos: [0]; default: 0;
         *  Represents whether or not an cycle-by-cycle mode action is on going.
         *  0:No action
         *  1: On going
         */
        uint32_t tzn_cbc_on:1;
        /** tzn_ost_on : RO; bitpos: [1]; default: 0;
         *  Represents whether or not an one-shot mode action is on going.
         *  0:No action
         *  1: On going
         */
        uint32_t tzn_ost_on:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} mcpwm_fhn_status_reg_t;

/** Type of cap_chn register
 *  CAPn capture value register
 */
typedef union {
    struct {
        /** capn_value : RO; bitpos: [31:0]; default: 0;
         *  Represents value of last capture on CAPn
         */
        uint32_t capn_value:32;
    };
    uint32_t val;
} mcpwm_cap_chn_reg_t;

/** Type of cap_status register
 *  Last capture trigger edge information register
 */
typedef union {
    struct {
        /** cap0_edge : RO; bitpos: [0]; default: 0;
         *  Represents edge of last capture trigger on channel0.
         *  0: Posedge
         *  1: Negedge
         */
        uint32_t cap0_edge:1;
        /** cap1_edge : RO; bitpos: [1]; default: 0;
         *  Represents edge of last capture trigger on channel1.
         *  0: Posedge
         *  1: Negedge
         */
        uint32_t cap1_edge:1;
        /** cap2_edge : RO; bitpos: [2]; default: 0;
         *  Represents edge of last capture trigger on channel2.
         *  0: Posedge
         *  1: Negedge
         */
        uint32_t cap2_edge:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} mcpwm_cap_status_reg_t;


/** Group: Interrupt register */
/** Type of int_ena register
 *  Interrupt enable register
 */
typedef union {
    struct {
        /** timer0_stop_int_ena : R/W; bitpos: [0]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered when the timer 0 stops.
         */
        uint32_t timer0_stop_int_ena:1;
        /** timer1_stop_int_ena : R/W; bitpos: [1]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered when the timer 1 stops.
         */
        uint32_t timer1_stop_int_ena:1;
        /** timer2_stop_int_ena : R/W; bitpos: [2]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered when the timer 2 stops.
         */
        uint32_t timer2_stop_int_ena:1;
        /** timer0_tez_int_ena : R/W; bitpos: [3]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by a PWM timer 0 TEZ event.
         */
        uint32_t timer0_tez_int_ena:1;
        /** timer1_tez_int_ena : R/W; bitpos: [4]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by a PWM timer 1 TEZ event.
         */
        uint32_t timer1_tez_int_ena:1;
        /** timer2_tez_int_ena : R/W; bitpos: [5]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by a PWM timer 2 TEZ event.
         */
        uint32_t timer2_tez_int_ena:1;
        /** timer0_tep_int_ena : R/W; bitpos: [6]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by a PWM timer 0 TEP event.
         */
        uint32_t timer0_tep_int_ena:1;
        /** timer1_tep_int_ena : R/W; bitpos: [7]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by a PWM timer 1 TEP event.
         */
        uint32_t timer1_tep_int_ena:1;
        /** timer2_tep_int_ena : R/W; bitpos: [8]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by a PWM timer 2 TEP event.
         */
        uint32_t timer2_tep_int_ena:1;
        /** fault0_int_ena : R/W; bitpos: [9]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered when event_f0 starts.
         */
        uint32_t fault0_int_ena:1;
        /** fault1_int_ena : R/W; bitpos: [10]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered when event_f1 starts.
         */
        uint32_t fault1_int_ena:1;
        /** fault2_int_ena : R/W; bitpos: [11]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered when event_f2 starts.
         */
        uint32_t fault2_int_ena:1;
        /** fault0_clr_int_ena : R/W; bitpos: [12]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered when event_f0 clears.
         */
        uint32_t fault0_clr_int_ena:1;
        /** fault1_clr_int_ena : R/W; bitpos: [13]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered when event_f1 clears.
         */
        uint32_t fault1_clr_int_ena:1;
        /** fault2_clr_int_ena : R/W; bitpos: [14]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered when event_f2 clears.
         */
        uint32_t fault2_clr_int_ena:1;
        /** cmpr0_tea_int_ena : R/W; bitpos: [15]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by a PWM operator 0 TEA event.
         */
        uint32_t cmpr0_tea_int_ena:1;
        /** cmpr1_tea_int_ena : R/W; bitpos: [16]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by a PWM operator 1 TEA event.
         */
        uint32_t cmpr1_tea_int_ena:1;
        /** cmpr2_tea_int_ena : R/W; bitpos: [17]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by a PWM operator 2 TEA event.
         */
        uint32_t cmpr2_tea_int_ena:1;
        /** cmpr0_teb_int_ena : R/W; bitpos: [18]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by a PWM operator 0 TEB event.
         */
        uint32_t cmpr0_teb_int_ena:1;
        /** cmpr1_teb_int_ena : R/W; bitpos: [19]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by a PWM operator 1 TEB event.
         */
        uint32_t cmpr1_teb_int_ena:1;
        /** cmpr2_teb_int_ena : R/W; bitpos: [20]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by a PWM operator 2 TEB event.
         */
        uint32_t cmpr2_teb_int_ena:1;
        /** tz0_cbc_int_ena : R/W; bitpos: [21]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by a cycle-by-cycle mode
         *  action on PWM0.
         */
        uint32_t tz0_cbc_int_ena:1;
        /** tz1_cbc_int_ena : R/W; bitpos: [22]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by a cycle-by-cycle mode
         *  action on PWM1.
         */
        uint32_t tz1_cbc_int_ena:1;
        /** tz2_cbc_int_ena : R/W; bitpos: [23]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by a cycle-by-cycle mode
         *  action on PWM2.
         */
        uint32_t tz2_cbc_int_ena:1;
        /** tz0_ost_int_ena : R/W; bitpos: [24]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by a one-shot mode action on
         *  PWM0.
         */
        uint32_t tz0_ost_int_ena:1;
        /** tz1_ost_int_ena : R/W; bitpos: [25]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by a one-shot mode action on
         *  PWM1.
         */
        uint32_t tz1_ost_int_ena:1;
        /** tz2_ost_int_ena : R/W; bitpos: [26]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by a one-shot mode action on
         *  PWM2.
         */
        uint32_t tz2_ost_int_ena:1;
        /** cap0_int_ena : R/W; bitpos: [27]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by capture on CAP0.
         */
        uint32_t cap0_int_ena:1;
        /** cap1_int_ena : R/W; bitpos: [28]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by capture on CAP1.
         */
        uint32_t cap1_int_ena:1;
        /** cap2_int_ena : R/W; bitpos: [29]; default: 0;
         *  Enable bit: Write 1 to enable the interrupt triggered by capture on CAP2.
         */
        uint32_t cap2_int_ena:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} mcpwm_int_ena_reg_t;

/** Type of int_raw register
 *  Interrupt raw status register
 */
typedef union {
    struct {
        /** timer0_stop_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered when the timer
         *  0 stops.
         */
        uint32_t timer0_stop_int_raw:1;
        /** timer1_stop_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered when the timer
         *  1 stops.
         */
        uint32_t timer1_stop_int_raw:1;
        /** timer2_stop_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered when the timer
         *  2 stops.
         */
        uint32_t timer2_stop_int_raw:1;
        /** timer0_tez_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by a PWM timer
         *  0 TEZ event.
         */
        uint32_t timer0_tez_int_raw:1;
        /** timer1_tez_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by a PWM timer
         *  1 TEZ event.
         */
        uint32_t timer1_tez_int_raw:1;
        /** timer2_tez_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by a PWM timer
         *  2 TEZ event.
         */
        uint32_t timer2_tez_int_raw:1;
        /** timer0_tep_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by a PWM timer
         *  0 TEP event.
         */
        uint32_t timer0_tep_int_raw:1;
        /** timer1_tep_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by a PWM timer
         *  1 TEP event.
         */
        uint32_t timer1_tep_int_raw:1;
        /** timer2_tep_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by a PWM timer
         *  2 TEP event.
         */
        uint32_t timer2_tep_int_raw:1;
        /** fault0_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered when event_f0
         *  starts.
         */
        uint32_t fault0_int_raw:1;
        /** fault1_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered when event_f1
         *  starts.
         */
        uint32_t fault1_int_raw:1;
        /** fault2_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered when event_f2
         *  starts.
         */
        uint32_t fault2_int_raw:1;
        /** fault0_clr_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered when event_f0
         *  clears.
         */
        uint32_t fault0_clr_int_raw:1;
        /** fault1_clr_int_raw : R/WTC/SS; bitpos: [13]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered when event_f1
         *  clears.
         */
        uint32_t fault1_clr_int_raw:1;
        /** fault2_clr_int_raw : R/WTC/SS; bitpos: [14]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered when event_f2
         *  clears.
         */
        uint32_t fault2_clr_int_raw:1;
        /** cmpr0_tea_int_raw : R/WTC/SS; bitpos: [15]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by a PWM
         *  operator 0 TEA event
         */
        uint32_t cmpr0_tea_int_raw:1;
        /** cmpr1_tea_int_raw : R/WTC/SS; bitpos: [16]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by a PWM
         *  operator 1 TEA event
         */
        uint32_t cmpr1_tea_int_raw:1;
        /** cmpr2_tea_int_raw : R/WTC/SS; bitpos: [17]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by a PWM
         *  operator 2 TEA event
         */
        uint32_t cmpr2_tea_int_raw:1;
        /** cmpr0_teb_int_raw : R/WTC/SS; bitpos: [18]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by a PWM
         *  operator 0 TEB event
         */
        uint32_t cmpr0_teb_int_raw:1;
        /** cmpr1_teb_int_raw : R/WTC/SS; bitpos: [19]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by a PWM
         *  operator 1 TEB event
         */
        uint32_t cmpr1_teb_int_raw:1;
        /** cmpr2_teb_int_raw : R/WTC/SS; bitpos: [20]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by a PWM
         *  operator 2 TEB event
         */
        uint32_t cmpr2_teb_int_raw:1;
        /** tz0_cbc_int_raw : R/WTC/SS; bitpos: [21]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by a
         *  cycle-by-cycle mode action on PWM0.
         */
        uint32_t tz0_cbc_int_raw:1;
        /** tz1_cbc_int_raw : R/WTC/SS; bitpos: [22]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by a
         *  cycle-by-cycle mode action on PWM1.
         */
        uint32_t tz1_cbc_int_raw:1;
        /** tz2_cbc_int_raw : R/WTC/SS; bitpos: [23]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by a
         *  cycle-by-cycle mode action on PWM2.
         */
        uint32_t tz2_cbc_int_raw:1;
        /** tz0_ost_int_raw : R/WTC/SS; bitpos: [24]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by a one-shot
         *  mode action on PWM0.
         */
        uint32_t tz0_ost_int_raw:1;
        /** tz1_ost_int_raw : R/WTC/SS; bitpos: [25]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by a one-shot
         *  mode action on PWM1.
         */
        uint32_t tz1_ost_int_raw:1;
        /** tz2_ost_int_raw : R/WTC/SS; bitpos: [26]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by a one-shot
         *  mode action on PWM2.
         */
        uint32_t tz2_ost_int_raw:1;
        /** cap0_int_raw : R/WTC/SS; bitpos: [27]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by capture on
         *  CAP0.
         */
        uint32_t cap0_int_raw:1;
        /** cap1_int_raw : R/WTC/SS; bitpos: [28]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by capture on
         *  CAP1.
         */
        uint32_t cap1_int_raw:1;
        /** cap2_int_raw : R/WTC/SS; bitpos: [29]; default: 0;
         *  Raw status bit: The raw interrupt status of the interrupt triggered by capture on
         *  CAP2.
         */
        uint32_t cap2_int_raw:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} mcpwm_int_raw_reg_t;

