espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/mcpwm_eco5_struct.h
typedef struct {
    volatile mcpwm_clk_cfg_reg_t clk_cfg;
    volatile mcpwm_timern_cfg0_reg_t timer0_cfg0;
    volatile mcpwm_timern_cfg1_reg_t timer0_cfg1;
    volatile mcpwm_timern_sync_reg_t timer0_sync;
    volatile mcpwm_timern_status_reg_t timer0_status;
    volatile mcpwm_timern_cfg0_reg_t timer1_cfg0;
    volatile mcpwm_timern_cfg1_reg_t timer1_cfg1;
    volatile mcpwm_timern_sync_reg_t timer1_sync;
    volatile mcpwm_timern_status_reg_t timer1_status;
    volatile mcpwm_timern_cfg0_reg_t timer2_cfg0;
    volatile mcpwm_timern_cfg1_reg_t timer2_cfg1;
    volatile mcpwm_timern_sync_reg_t timer2_sync;
    volatile mcpwm_timern_status_reg_t timer2_status;
    volatile mcpwm_timer_synci_cfg_reg_t timer_synci_cfg;
    volatile mcpwm_operator_timersel_reg_t operator_timersel;
    volatile mcpwm_genn_stmp_cfg_reg_t gen0_stmp_cfg;
    volatile mcpwm_genn_tstmp_a_reg_t gen0_tstmp_a;
    volatile mcpwm_genn_tstmp_b_reg_t gen0_tstmp_b;
    volatile mcpwm_genn_cfg0_reg_t gen0_cfg0;
    volatile mcpwm_genn_force_reg_t gen0_force;
    volatile mcpwm_genn_a_reg_t gen0_a;
    volatile mcpwm_genn_b_reg_t gen0_b;
    volatile mcpwm_dtn_cfg_reg_t dt0_cfg;
    volatile mcpwm_dtn_fed_cfg_reg_t dt0_fed_cfg;
    volatile mcpwm_dtn_red_cfg_reg_t dt0_red_cfg;
    volatile mcpwm_carriern_cfg_reg_t carrier0_cfg;
    volatile mcpwm_fhn_cfg0_reg_t fh0_cfg0;
    volatile mcpwm_fhn_cfg1_reg_t fh0_cfg1;
    volatile mcpwm_fhn_status_reg_t fh0_status;
    volatile mcpwm_genn_stmp_cfg_reg_t gen1_stmp_cfg;
    volatile mcpwm_genn_tstmp_a_reg_t gen1_tstmp_a;
    volatile mcpwm_genn_tstmp_b_reg_t gen1_tstmp_b;
    volatile mcpwm_genn_cfg0_reg_t gen1_cfg0;
    volatile mcpwm_genn_force_reg_t gen1_force;
    volatile mcpwm_genn_a_reg_t gen1_a;
    volatile mcpwm_genn_b_reg_t gen1_b;
    volatile mcpwm_dtn_cfg_reg_t dt1_cfg;
    volatile mcpwm_dtn_fed_cfg_reg_t dt1_fed_cfg;
    volatile mcpwm_dtn_red_cfg_reg_t dt1_red_cfg;
    volatile mcpwm_carriern_cfg_reg_t carrier1_cfg;
    volatile mcpwm_fhn_cfg0_reg_t fh1_cfg0;
    volatile mcpwm_fhn_cfg1_reg_t fh1_cfg1;
    volatile mcpwm_fhn_status_reg_t fh1_status;
    volatile mcpwm_genn_stmp_cfg_reg_t gen2_stmp_cfg;
    volatile mcpwm_genn_tstmp_a_reg_t gen2_tstmp_a;
    volatile mcpwm_genn_tstmp_b_reg_t gen2_tstmp_b;
    volatile mcpwm_genn_cfg0_reg_t gen2_cfg0;
    volatile mcpwm_genn_force_reg_t gen2_force;
    volatile mcpwm_genn_a_reg_t gen2_a;
    volatile mcpwm_genn_b_reg_t gen2_b;
    volatile mcpwm_dtn_cfg_reg_t dt2_cfg;
    volatile mcpwm_dtn_fed_cfg_reg_t dt2_fed_cfg;
    volatile mcpwm_dtn_red_cfg_reg_t dt2_red_cfg;
    volatile mcpwm_carriern_cfg_reg_t carrier2_cfg;
    volatile mcpwm_fhn_cfg0_reg_t fh2_cfg0;
    volatile mcpwm_fhn_cfg1_reg_t fh2_cfg1;
    volatile mcpwm_fhn_status_reg_t fh2_status;
    volatile mcpwm_fault_detect_reg_t fault_detect;
    volatile mcpwm_cap_timer_cfg_reg_t cap_timer_cfg;
    volatile mcpwm_cap_timer_phase_reg_t cap_timer_phase;
    volatile mcpwm_cap_chn_cfg_reg_t cap_chn_cfg[3];
    volatile mcpwm_cap_chn_reg_t cap_chn[3];
    volatile mcpwm_cap_status_reg_t cap_status;
    volatile mcpwm_update_cfg_reg_t update_cfg;
    volatile mcpwm_int_ena_reg_t int_ena;
    volatile mcpwm_int_raw_reg_t int_raw;
    volatile mcpwm_int_st_reg_t int_st;
    volatile mcpwm_int_clr_reg_t int_clr;
    volatile mcpwm_evt_en_reg_t evt_en;
    volatile mcpwm_task_en_reg_t task_en;
    volatile mcpwm_evt_en2_reg_t evt_en2;
    volatile mcpwm_opn_tstmp_e1_reg_t op0_tstmp_e1;
    volatile mcpwm_opn_tstmp_e2_reg_t op0_tstmp_e2;
    volatile mcpwm_opn_tstmp_e1_reg_t op1_tstmp_e1;
    volatile mcpwm_opn_tstmp_e2_reg_t op1_tstmp_e2;
    volatile mcpwm_opn_tstmp_e1_reg_t op2_tstmp_e1;
    volatile mcpwm_opn_tstmp_e2_reg_t op2_tstmp_e2;
    volatile mcpwm_clk_reg_t clk;
    volatile mcpwm_version_reg_t version;
} mcpwm_dev_t;

extern mcpwm_dev_t MCPWM0;
extern mcpwm_dev_t MCPWM1;

#ifndef __cplusplus
_Static_assert(sizeof(mcpwm_dev_t) == 0x14c, "Invalid size of mcpwm_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
